---
kind: method
id: M:Autodesk.Revit.DB.Lighting.SpotLightDistribution.#ctor
source: html/8a6bfc11-674a-c63a-a9c6-0cbdccaf095a.htm
---
# Autodesk.Revit.DB.Lighting.SpotLightDistribution.#ctor Method

Creates a spot light distribution object with the following values;
 PI/6 radians spot beam angle PI/2 radians spot field angle PI/6 radians tilt angle

## Syntax (C#)
```csharp
public SpotLightDistribution()
```